src/CFD/heatedplate6.1.1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          660;
        startFace       21708;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       22368;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          540;
        startFace       22488;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       23028;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       23100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2640;
        startFace       23172;
    }
)

// ************************************************************************* //
